import React from "react";
import styles from "../../../styles/home/HeroColumn.module.css";
import fontSizes from "../../../styles/fontSizes/fontSizes.module.css";
import { Link } from "react-router-dom";

const HeroColumn = () => {
  const ticker = [
    "از آنجا که لورم ایپسوم، شباهت زیادی به متن های واقعی دارد، طراحان معمولا از لورم ایپسوم استفاده میکنند تا فقط به مشتری یا کار فرما نشان دهند که قالب طراحی شده بعد از اینکه متن در آن قرار میگرد چگونه خواهد بود و فونت ها و اندازه ها چگونه در نظر گرفته شده است.",
    "اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) متنی ساختگی و بدون معنی است که برای امتحان فونت و یا پر کردن فضا در یک طراحی گرافیکی و یا صنعت چاپ استفاده میشود. طراحان وب و گرافیک از این متن برای پرکردن صفحه و ارائه شکل کلی طرح استفاده می‌کنند.",
    "نکته بعدی در مورد متن ساختگی لورم ایپسوم این است که بعضی از طراحان وبسایت و گرافیست کاران بعد از آنکه قالب و محتوای مورد نظرشون را ایجاد کردند از یاد می‌برند که متن لورم را از قسمتهای مختلف سایت حذف کنند و یا با متن دیگری جایگزین کنند. به همین دلیل اغلب اوقات ما با وبسایتهایی مواجه می‌شویم که در گوشه و کنار صفحات آنها متن لورم ایپسوم هنوز وجود دارد و حذف نشده است که این نشان دهنده بی توجهی طراحان است.",
    "ابزار جامع و تخصصی ویرایش آنلاین متون فارسی است که با به‌کارگیری روش‌های پیشرفته‌ی پردازش زبان و با هدف پاسداشت خط و زبان فارسی توسعه یافته است. این ابزار، متون موردنظر شما را براساس دستور خط و فرهنگ املایی مصوب فرهنگستان زبان و ادب فارسی بررسی کرده و تمامی نویسه‌های متن را با استانداردهای موجود مطابقت می‌دهد. بطور کلی می‌توان گفت که ویراستار پینگو به شما کمک می‌کند تا متون فارسی را زیبا‌تر بنویسید. ",
    "و رویکردهای متنوع در تولید است که با مدل‌های متمرکزتر توسعه چون آن‌هایی که معمولاً در شرکت‌های نرم‌افزاری تجاری به کار می‌رود، در تضاد است. اصل و عمل عمده در توسعهٔ نرم‌افزار متن‌باز، شبه‌تولید به‌وسیلهٔٔ دادوستد و همکاری، با محصول نهایی (و مادهٔ منبع) است که بدون هیچ هزینه‌ای در دسترس عموم است.",
    " به عنوان دلسردکننده پذیرش تجارت شناخته می‌شد. این گروه شامل کریستین پیترسون، تاد اندرسون، لری آگوستین، جون هال، سام اوکمن، مایکل نایمن و اریک اس ریموند بود. پترسون در نشستی که در پالو آلتو، کالیفرنیا برگزار شد، در واکنش به اعلامیه نت اسکیپ در ژانویه ۱۹۹۸ مبنی بر",
    "مکاری باز اصلی اساسی در تولید همتا، همکاری انبوه و ویکینومیک است. این در ابتدا در نرم‌افزارهای منبع باز مشاهده شد، اما در بسیاری از موارد دیگر مانند تالارهای گفتگوی اینترنتی، لیست‌های پستی، جوامع اینترنتی و موارد بسیاری از محتوای بازمانند Creative Commons نیز یافت می‌شود. همچنین برخی از موارد منابع عمومی، مصرف مشارکتی و نوآوری باز را توضیح می‌دهد.",
  ];

  return (
    <div className="col-12 col-md-5">
      <Link to={"/market"}>
        <h1 className={`fw-bolder ${fontSizes.px16} text-center p-1 ${styles.heroColumeTitle}`}>
          شناخت‌بازار
        </h1>
      </Link>
      <p className={`${fontSizes.px12} fw-bold text-center mt-3`}>
        <span className="ps-1">
          <img src="./assets/images/heroSliders/blueDot/blueDot1.gif" alt="blue dot" width={"15px"} />
        </span>
        نخستین دیوار تخصصی نیازمندی‌ها و ارائۀ خدمات پژوهشی اجتماعی
      </p>
      <div className={`${styles.heroColumnSet}`}>
        <div>
          <div className={styles.tickerWrapper}>
            {ticker.map((item, index) => (
              <Link key={index} to={`/merket/${index}`}>
                <div className={`${fontSizes.px10} ${styles.tickerItem}`} key={index}>
                  <span className={`me-1 mb-4`}>
                    <img src="./assets/images/icons/profile.png" width={"35px"} alt="profile" />
                  </span>
                  <p>{item.substring(0, 200)}...</p>
                </div>
              </Link>
            ))}
          </div>
        </div>
      </div>
      <Link to={"/market"} className={`${fontSizes.px12} white ${styles.btn}`}>
        مشاهده همۀ سفارش‌ها
      </Link>
    </div>
  );
};

export default HeroColumn;
